---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.PipingFailures
source: html/bf81f184-6c3b-a4b1-f72d-2ca5a3e4f275.htm
---
# BuiltInFailures.PipingFailures Properties

Cannot create geometry for flex pipe. The flex pipe is intersecting itself or the start and end are too close together.